// src/models/user.js
// --------------------------
// Модель користувача (Реєстрація користувачів)

import { model, Schema } from 'mongoose';

const userSchema = new Schema(
  {
    username: { type: String, trim: true },
    email: { type: String, unique: true, required: true, trim: true },
    password: { type: String, required: true, minlength: 8 },
    // (5.8.1) Аватар користувача / додаємо необов’язкову властивість
    avatar: {
      type: String,
      required: false,
      default: 'https://ac.goit.global/fullstack/react/default-avatar.jpg',
    },
  },
  {
    timestamps: true,
    versionKey: false,
  },
);

// використовуємо pre-hook Schema.pre("save"), який виконується перед збереженням користувача, щоб у майбутньому користувач міг змінити ім’я у профілі, функція не може бути стрілковою (через this).
userSchema.pre('save', async function () {
  if (!this.username) {
    this.username = this.email;
  }
});

// Перевизначаємо метод toJSON (видалення паролю з відповіді)
userSchema.methods.toJSON = function () {
  const obj = this.toObject();
  delete obj.password;
  return obj;
};

export const User = model('User', userSchema);

// ================== (TASK 04.01 - to do list) ==================
// Модель користувача
// ----------------------------
// У файлі src/models/user.js створіть модель User із такими властивостями:

// username — рядок, не обов’язкове поле, з параметром trim: true;
// email — рядок, унікальне, обов’язкове, з параметром trim: true;
// password — рядок, обов’язкове, мінімальна довжина — 8 символів.

// Для автоматичного створення полів createdAt та updatedAt, використовуйте параметр timestamps: true при створенні моделі.
// Додайте до схеми userSchema метод toJSON, щоб видаляти пароль із об'єкта користувача перед відправкою у відповідь.
// Створіть хук pre('save'), щоб за замовчуванням встановлювати username таким самим, як email, при створенні користувача.

// ======================= (COMMENTS) =====================
// Реєстрація користувачів
// Будь-яка робота з аутентифікацією та авторизацією починається з реєстрації користувачів. Користувач — це окрема сутність у нашому додатку, тому спочатку потрібно створити для нього модель.
// ---------------------------------------------------
// 1) Модель користувача
// src/models/user.js

// 2) Схема валідації
// src/validations/authValidation.js

// 3) Контролер та маршрут
// src/controllers/authController.js

// 4) Маршрут для реєстрації:
// src/routes/authRoutes.js

// 5) І підключаємо новий роут у сервері:
// src/server.js
// ---------------------------------------------------
// Таким чином, ми створили модель користувача, налаштували валідацію для реєстрації та підключили маршрут POST /auth/register. Наступний крок — реалізація логіки створення користувача та хешування паролю
// ---------------------------------------------------

// Модель користувача
// -------------------------
// Ми використовуємо email як унікальний ідентифікатор користувача. Тому додаємо до цього поля unique: true.
// username — необов’язкове поле. За замовчуванням воно дорівнює email користувача. У майбутньому користувач зможе змінити ім’я у профілі.
// Для цього ми використовуємо pre-hook Schema.pre("save"), який виконується перед збереженням користувача.
// Оскільки ми використовуємо this (посилання на поточний документ), функція не може бути стрілковою.
// --------------------------
